

// first problems........
// ক্লাস সেভের এর ফাইনাল এক্সাম এ তুমি ফার্স্ট হয়েছ। তোমার বন্ধু আলিয়া, ডালিয়া, সালিয়া, মালিয়া, লিলিয়া আর জ্বালাইয়া - তাদের grade তুমি জানো না। তবে তাদের নম্বর জানো.আলিয়া 95 পেয়েছে, ডালিয়া 66 পেয়েছে, সালিয়া 80 পেয়েছে, মালিয়া পেয়েছে 59, লিলিয়া পেয়েছে 47, জ্বালাইয়া পেয়েছে 77। তুমি JS code দিয়ে তাদের grade বের করে দিতে পারবে ?
// var mark  ;
// if (89 < mark) {
//     console.log("Gread-AA");
// }
// else if (79 < mark) {
//     console.log("Gread-A+");
// }
// else if (69 < mark) {
//     console.log("Gread-B");
// }
// else if (59 < mark) {
//     console.log("Gread-C");
// }
// else if (49 < mark) {
//     console.log("Grade-D")
// }
// else {
//     console.log("Gread-F")
// }


// Problems:তাড়াহুড়া করে স্কুলের জন্য বের হচ্ছ কিন্তু রাস্তা পার হওয়ার সময় দেখলে, ট্রাফিক সিগন্যাল লাল রং। এই অবস্থায় যদি তুমি রাস্তা পার হওয়ার চেষ্টা কর, তাহলে ডেঞ্জার হতে পারে। যদি হলুদ রং হয় তাহলে তোমার থেমে যাওয়া উচিত। আর যদি ট্রাফিক সিগন্যাল গ্রিন হয় তাহলে তোমার রাস্তা পার হওয়া উচিত। তাই একটা কোড লিখে ফেলো। যেখানে আমরা signal নামে একটা ভেরিয়েবল থাকবে। সেটার মান green, yellow বা red হতে পারে। সেই অনুসারে ডিফারেন্ট ডিফারেন্ট কাজ হবে। তো,
//  সেই কোড ফটাফট লিখে ফেলো।
var signal='red';

if('red'==signal){
    console.log("Please! Stop")
}
else if('yellow'==signal){
    console.log("Move Sololy")
}
else{
    console.log("moving")
}